In [1]:
pip install PyMySQL

Requirement already satisfied: PyMySQL in c:\users\miles.mile-bl-4572-la\anaconda3\lib\site-packages (1.0.2)Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import sqlalchemy as sq

In [16]:
engine=sq.create_engine('mysql+pymysql://root:Zs123786@localhost:3306/test')

In [32]:
df=pd.read_sql_table('students2',engine)
df

   sid    name branch  marks college
0    1     zee    cse    100   KITSW
1    2   saran   mech    200    NITW
2    3  charan    ece    300   KITSW

In [36]:
df['marks']=df['marks'].apply(lambda x:x//10)
df

   sid    name branch  marks college
0    1     zee    cse     10   KITSW
1    2   saran   mech     20    NITW
2    3  charan    ece     30   KITSW

In [37]:
df.to_sql('students2',engine,if_exists='replace')

3